import numpy as np

A = np.array([[2, 1, -1],
              [3, 2, 1],
              [1, -1, 2]])

# Задайте столбец свободных членов b
b = np.array([8, 13, 4])

# Решите СЛАУ и найдите значения неизвестных x
result = np.linalg.solve(A, b)

# Выведите результат на экран
print("result =", result)


#Эта программа на Python решает 3 линейных уравнения:
#2x+1y+(-1i)=8
#3x+2y+1i=13
#1x+(-1y)+2i=4