###########################################################################################################################
#Даны действительные числа x, y. Вычислить z: z=
#https://ivtipm.github.io/Programming/Glava02/index02.htm#z38                                           ###
###########################################################################################################################

print("x=", end=" ")
x=float(input())

print("y=", end=" ")
y=float(input())

if x>y:
    z=x-y
    
else:
    z=y-x+1   
    
print(f'z={z:.2f}')