###########################################################################################################################
#Смешано V1 литров воды температуры t1 с V2 литрами воды температуры t2. Найти объём и температуру образовавшейся смеси.###
###########################################################################################################################
print("t1", end=" ")
t1=int(input())

print("v1", end=" ")
v1=int(input())

print("t1", end=" ")
t2=int(input())

print("v1", end=" ")
v2=int(input())


v3=v1+v2
t3=(t1+t2)/2

print(f'v3={v3:.2f}')
print(f't3={t3:.2f}')